quest_system_1366081330_name=^?^Barricaded
quest_system_1366081330_stage_0=^?^Proceed over Ardan's Peaks to the barricaded miners.
quest_system_1366081330_stage_1=^?^Return to Taganrog.
quest_system_1366081330_task=^?^The demons' siege is lifted, but the miners have barricaded themselves behind closed doors. You must travel over the cold Ardan's Peaks, and convince the miners that they are now safe.<br>[reward]
